[
	{
		"number": 0,
		"text": "It's quite sad to read some of the reviews of this film. \"full of clichés\" \"typical weak war film\" etc. I would like for the writers of such comments to look at the film they \"coughed up their reddies\" for, and ask what they were really after? Do they know what the film was about? The director's aim was to create an honest depiction of a real life event. To tell the story of a battle and war in a way that would make people who weren't there understand what it may have been like. To bring home the stark realisation of how scary the battlefield would be, and explore the wider picture of how families, and even the enemy were affected by events too. Many of the words used by the dying men are documented as being the actual words. In the editors commentary, he explains \"these were the true dying words 'tell my wife I love her'. In that situation, it is the reality of what is on people's minds. I'm sorry they couldn't have come up with something more melo-dramatic for the theatre audience.\" The line that really bought it home for me though was that soldiers who had fought in that battle thanked the director. They said he had managed to show the realities of an event in their lives that they had, to that point, never managed to fully explain to their families. If the people who were there say this is a realistic account of events and emotions, then that's the best accolade a film can have. I was scared and moved by it and would recommend it highly. PS. to the plot critics out there... would you rather they sexed up a true story? Surely that would be a grave tragedy."
	},
	{
		"number": 1,
		"text": "I live with a Vietnam Vet who served in the late 1960s with 1st Cav. Medivac. During service he earned two Purple Hearts, the Distinguished Flying Cross, and the Air Medal. Since WE WERE SOLDIERS concerns the 1st Cav., Randy wanted to see it. I reluctantly agreed; I am not partial to war films and I dislike Mel Gibson, and Randy is very hard on Vietnam War films. He dismisses PLATOON as a Hollywood 8x10 glossy; says APOCALYPSE NOW is an interesting movie that captures the paranoia, but all the technical details are wrong; and describes DEER HUNTER as excellent in its depiction of the strangeness of coming home but so full of plot holes that he can hardly endure it. And about one and all he says: \"It wasn't like that.\"He was silent through the film, and when we left the theatre I asked what he thought. He said, \"They finally got it. That's what it was like. All the details are right. The actors were just like the men I knew. They looked like that and they talked like that. And the army wives too, they really were like that, at least every one I ever knew.\" The he was silent for a long time. At last he said, \"You remember the scene where the guy tries to pick up a burn victim by the legs and all the skin slides off? Something like that happened to me once. It was at a helicopter crash. I went to pick him up and all the skin just slid right off. It looked just like that, too. I've never told any one about it.\" In most respects WE WERE SOLDIERS is a war movie plain and simple. There are several moments when the film relates the war to the politics and social movements that swirled about it, and the near destruction of the 1st. Cav.'s 7th Battalion at Ia Drang clearly arises from the top brass' foolish decision to send the 7th into an obvious ambush--but the film is not so much interested in what was going on at home or at the army's top as it is in what was actually occurring on the ground. And in this it is extremely meticulous, detailed, and often horrifically successful. Neither Randy nor I--nor any one in the theatre I could see--was bored by or dismissive of the film. It grabs you and it grabs you hard, and I can easily say that it is one of the finest war movies I have ever seen, far superior to the likes of SAVING PRIVATE RYAN, which seems quite tame in comparison.Perhaps the single most impressive thing about the film is that it never casts its characters in a heroic light; they are simply soldiers who have been sent to do a job, and they do it knowing the risks, and they do it well in spite of the odds. Mel Gibson, although I generally despise him as both an actor and a human being, is very, very good as commanding officer Hal Moore, and he is equaled by Sam Elliot, Greg Kinnear, Chris Klein, and every other actor on the battlefield. The supporting female cast, seen early in the film and in shorter scenes showing the home front as the battle rages, is also particularly fine, with Julie Moore able to convey in glance what most actresses could not communicate in five pages of dialogue. The script, direction, cinematography, and special effects are sharp, fast, and possess a \"you are there\" quality that is very powerful.I myself had a criticism; there were points in the film when I found the use of a very modernistic, new-agey piece of music to be intrusive and out of place. And we both felt that a scene near the end of the movie, when a Vietnamese commander comments on the battle, to be improbable and faintly absurd. But these are nit-picky quibbles. WE WERE SOLDIERS is a damn fine movie. I'll give Randy, who served two tours of duty in Vietnam, the last word: \"It may not be 'the' Vietnam movie. I don't think there could ever be 'the' Vietnam movie. But they pretty much get everything right. That's how it looked and sounded, and that's what I saw, and this is the best movie about Vietnam I've ever seen.\" Gary F. Taylor, aka GFT, Amazon Reviewer"
	},
	{
		"number": 2,
		"text": "I was privileged to see a preview of Mel Gibson's new film \"We Were Soldiers\" based upon the book written by his real life character, Lt. Col. Harold Moore, along with Joe Galloway. I attended a showing along with numerous other Viet Nam vets and it would seem that there were as many opinions about the movie as there were viewers.  Like the war itself, each person in attendance probably had some personal experiences that the movie brought back from that deep, and sometimes distant, place we have put them.The movie was almost overwhelmingly graphical, but afterwards I realized this was instrumental in the telling of the story.  For the movie is truly about the leadership that Col. Moore brought to his men of the 1st of the 7th, and his determination that they would not suffer the fate of the French in Viet Nam, nor his own unit's most infamous battle, that of Custer's Stand at Little Big Horn.It was his determination and commitment that his men be as highly trained, as strongly molded as a unit, and most importantly as well lead as possible that stands out. This determination is obviously rooted in his deeply abiding belief that military leaders shall never forget that when they lead men into war, many of those men will never come back alive, but that those who lead shall never abandon them, even in their shared darkest hours.And while the movie highly succeeds in conveying the horror and tragedy that war is....has been...and always shall be, it was more difficult for me to realize that our War Department and Army could have been so callous as to have delegated the responsibility of notifying next-of-kin of the death of their loved ones to the local Yellow Cab company. Then I realized that in late 1965 it was all so new and no one knew that this war was going to grow and consume so many young American lives over the next nine years.The two most significant scenes in the movie for me were firstly, the scene when the course of the battle teeters on the brink of either disaster or success and the most important communication that Col. Moore's superiors have to convey is that General Westmoreland would like for him to leave the battlefield and fly to Saigon so the general can have a briefing. This more than anything pointed out how tragically we were doomed to failure in Viet Nam due to the political will, not the military will, being in control. The second most significant scene was in the airport where one soldier is pushing his buddy through the concourse and the voice over says...\"They did not fight for God.....country.....right. They fought for each other\", a fact that every Viet Nam vet would attest to.This a movie worth seeing. It is another testament, with a worthy cinematographic effort, to the futility and absurdity of war, and how that among madness can be greatness. It is a movie that will unlikely leave the viewer devoid of emotion.  What those emotions may be are as likely to be as highly personal, as the strength of their feeling."
	},
	{
		"number": 3,
		"text": "Ever since 1970 when I finished my third tour of combat duty with the Marines in Viet Nam I have been waiting for a film that reflected the American Fighting Man in the Viet Nam war as an American Fighting Man; not a drugged-out, anti-war whiner. Well this is it. The movie is non-stop action after the first fifteen minutes of character development is finished. Having experienced what it is like to be over-run by the NVA during the third week of my first VN tour I can tell you that this movie does an excellent job of showing the excitement, tension, exhaustion, chaos, and courage of an extended battle. While this is by no means the best war movie I have ever seen, it is the first Viet Nam war movie which has provided me with a sense of satisfaction after leaving the theater. Mel Gibson turns in a good performance, Sam Elliot is a bit stiff. The wives of the soldiers are believable. Including a bit of the NVA's attitude about the war adds a balanced flavor to the film. Overall I would say that you will experience at least a small part the intensity of war if you go to this movie. I took my female companion and she was shocked, touched, and thrilled with it. As Americans, we need to remember that freedom is not, and never has been, free. It is always paid for with the blood of those who fight to get it, sustain it, or expand it. The politically correct may not like this film, but then who cares what they like. Thanks for making this film Mel. I've been waiting over 30 years to see it."
	},
	{
		"number": 4,
		"text": "`Saving Private Ryan' redefined the war genre and opened the floodgates to a new generation of war movies.  It pushed the boundaries of acceptability by frankly showing war in all its grisly glory.  As such it gave us a better understanding of how terrible and frightening war is.  `Black Hawk Down' took the graphic violence to a new level, with an intensity that matched the beach landing of SPR, but of a duration that was almost unbearable.`We Were Soldiers' is the latest big budget war offering from Hollywood. In many ways, I consider this to be the most complete of the three. Writer/Director Randall Wallace (who wrote \"Braveheart\", \"Pearl Harbor\" and the screenplay for this film), takes the understanding of war to the next level, by offering more than one perspective to the events.  Of the three films, this film has the best workup, the best character development, and the most nuanced look at the battle.  He brings all the sustained intensity of BHD in the action sequences, but introduces the NVA perspective, the wives' perspective and a far more charismatic and heroic central figure in Lt. Col. Hal Moore.Based on real events, this film shows war as being horrendous and heartless to both sides.  It expands outside the combat zone to visit the ramifications on the families as well.  The scenes with the wives getting the telegrams are poignant reminders of how war reaches beyond the battlefield.  Wallace's treatment grabs us on an emotional level and shocks the senses.  Unlike BHD, which presented the characters in a very anonymous way, we come to know these characters and their families and identify with them.Of course, the film lacks the hard edge that would make it starkly believable.  It is after all a Hollywood production and not a documentary. However, Wallace pours enough realism into the depictions to assure that this doesn't turn into another sappy melodrama like `Pearl Harbor', which was really nothing more than a romance with a long battle scene in the middle.  Wallace finds the optimal balance between engaging storytelling and the brutality of combat.The acting is excellent.  Mel Gibson offers the right combination of hard nosed officer and father figure (both to his children and his men). Gibson is steadfast and courageous without being harsh.  His portrayal of Moore is so well played, so charismatic and heroic, that it is impossible to believe that such a person could actually exist.Sam Elliot follows an outstanding performance in `The Contender' with this gem as Sergeant Major Plumley, the tough as nails warhorse who serves as Moore's non commissioned adjutant.  Elliot plays the intransigent career soldier to the hilt, where nothing including life itself is more important than honor and discipline.  Barry Pepper also turns in a fine performance as Joe Galloway, the photo journalist who hops on a helicopter to take pictures in the center of the battle and finds himself with a rifle in his hands fighting for his life.This is among the best war films in recent memory and probably the best film on the Vietnam War film since `Full Metal Jacket'.  I rated it a 10/10. This film is not for everyone.  It contains graphic violence and disturbingly realistic battle scenes.  It is a gripping and distressing film that should be required viewing for statesmen and generals alike."
	},
	{
		"number": 5,
		"text": "This film is so different from the traditionally cynical (and rightly so) Vietnam War movies.  While it goes without question that this film depicts the bloody and gruesome horrors of the tragedy of the first major conflict of the war, it does so while juxtaposing the story with that of stories of the home front and the enemy.  The enemy in this film is not the animalistic, silent enemy we are used to.  We hear this enemy speak, we see his love for his family and his devotion to his cause.  While being bombarded with images of death and destruction on the battlefield, we are brought back home to see the wives as they face the death themselves.\nWhile of course not a flawless movie, it was without a doubt moving, and I highly recommend it."
	},
	{
		"number": 6,
		"text": "I should never be surprised that people, who wouldn't recognize Principle, much less Honor, Duty, or Country if it introduced itself, see virtue as vice.  As one who served in that war, I found the movie to be factual to the point of pain.  Those who call this movie racist, lack vocabulary. or an understanding of racism.  I don't know which is sadder.  This movie tells a part of a soldier's story very well.  Soldiers march to a different drummer, how tragic that so many, today, still refuse to honor those who protected them.The millions in Indo-China murdered at the hands of the Communist cry that our \"racism\" was so poorly lead at the highest civilian levels that we abandon them.  Their blood is not on my hands or on the hands of my fellow soldiers.  It is on the hands of those who are so blind they refuse to see. A valid case could be made that that there are errors in the story, certainly it doesn't tell the rest of the story, or of the next part of this battle where US casualties were 40%.  What it does tell it tells very well. Those men were volunteers, and their nobility shows in this movie.  I recommend it, especially for any who would want to understand those who served at that time."
	},
	{
		"number": 7,
		"text": "\"We Were Soldiers\" is based on a real life battle of the Viet Nam war that took place in 1965 in a remote part of Viet Nam. It is based on a book by Harold G. Moore and Joseph L. Galloway who are portrayed in the film by Mel Gibson and Barry Pepper respectively. The film opens with a depiction of the 1954 slaughter of French troops by the Vietnamese army. Twenty one years later Lt. Col Moore (Gibson) and his battalion of 395 men are thrust unknowingly into the same hornet's nest consisting of some 4,000 battle hardened Viet Nam regulars who have been fighting their enemies for many years.  Director Randall Wallace tells the story from three perspectives. Firstly from the viewpoint of the Americans. Outnumbered ten to one they face impossible odds. How Col. Moore rallies his troops and gets them to pull together as a team is a central theme of the picture. Secondly, the story is told from the viewpoint of the wives and families left behind and the problems they have to deal with. Lastly, the Vietnamese army is shown not as unfeeling monsters, but as a professional army defending their beliefs and territory. The battle scenes are as realistic and convincing as any war movie that you will ever see. We suffer through the casualties both on the battlefield and at home along with the participants. The special effects are seamless and exciting. Mel Gibson gives a convincing performance as Moore and if you watch the DVD, you can see the amazing similarities between the two men. Madeleine Stowe plays Julie Moore and Keri Russell plays Barbara Geoghegan two of the wives who take on the unenviable task of delivering those dreaded telegrams to the widows from the War Department. Chris Klein plays Russell's husband Jack a new officer and father. His scene with Gibson in the base chapel is memorable. Greg Kinnear plays Captain Crandall the head of Moore's helicopter fleet. Don Duong is very effective as the Vietnamese commander. But acting cudos go to veteran Sam Elliot as the crusty Sgt. Major Plumley. \"We Were Soldiers\" is a gripping Viet Nam war drama told in a way that reflects ALL of the participants in an impartially realistic way. As Hank Moore says on the DVD, They finally got it right."
	},
	{
		"number": 8,
		"text": "This has to be the most real war story I have seen... ever. I found Black Hawk Down laughable, Windtalkers sad, but this... wow.This is an excellent film that tells the true tale from the biography of Lt. Col. Hal Morris. It shows the horrors that the families go through, as well as the men. It even shows how the \"enemy\" are people too.I would like to make a personal editorial here, since I feel a great wrong has been posted about this movie by some people here... To all the people calling this flag waving propaganda, you obviously didn't watch the movie, hence I feel your votes should be removed for this film. If anything, it showed the horrors of war, how our men suffered for what was believed to be a noble mission, and how in spite of terrible odds they overcame, and the promise that \"No one will be left behind\" was kept. I know people who were there. They ended up having nightmares because it hit so close to home. This was REAL. If it were propaganda, everyone would get home and we would all be happy. You want to talk Propaganda, watch almost any John Wayne movie, or even Patton. This was not. Men died. Good Men. Family men - on both sides. Yes, the only way we survived that battle was superior technology, but it was the only reason. They were dropped into an ambush, yet they survived. Lt. Col. Morris didn't come back proud of what he did, he was just happy the mission was accomplished and they survived. Yet, he was hurt badly by every wasted life. Propaganda? You totally missed the point! Is propaganda showing how we killed our own men because of our mistakes? Lies? Tell me, were you there? I didn't think so. Unless you were there, stop with the misinformation. Your the ones spreading propaganda and lies, not the film! If you want to get picky, then I will cover one more thing. Was there some fictionalizing? Of course! they had to squeeze in over 40 characters into a few leads! Lots of stuff had to be cut, so things were glossed over and cut. I'm not saying it's perfect in character detail, but the overall story was left in tact. This was not a Hollywood story even with the changes. The plot did not deceive. That battle was as real as a recreation could be. Even Lt. Col. Hal Morris, who is retired and was there, says so. Even my ex-boss and a couple other friends, who were either at that battle or at Nam, said so. If anyone has a right to point out lies, it's our ignored and abused Nam veterans.My apologies to everyone else for that rant."
	},
	{
		"number": 9,
		"text": "In November of 1968, the North Vietnamese still held to the old principle of \"Control the Central Highlands and you control Vietnam\". Three years to the month after the battle of LZ X-Ray, I led a LRRP (Long Range Recon Patrol)team from Duc Co south toward the Ia Drang River. We never made it to the river. Instead, we spent a very long afternoon of E&E, along with intermittent combat. Thus, my worst day of the war was within 1/2 mile of LZ X-Ray.I know that area well. The locations for the movie were excellent. LTG. Moore's principle was still in use, ie, when the Air Force choppers I had contacted on an emergency radio picked us up, my foot was the last to leave the ground. (Not heroism, just the way we did it.) By the way,Those aren't \"radio towers\", they are parachute training towers on Eubanks Field, Fort Benning Ga. (Almost the same shot as in \"The Green Berets\" when Wayne saw the airborne recruits running shirtless in formation.I was in college during the battle, but what I learned later I saw confirmed in the book and movie. Thank you General Moore and Mr. Galloway for the book and thank you Mel Gibson and Randall Wallace for the movie. (Being of Scottish descent, I also thank you two for \"Braveheart\")"
	},
	{
		"number": 10,
		"text": "A friend of mine who fought 3 tours in Vietnam says, \"A war movie critiqued by civilians is like a porno movie critiqued by a nun\".  Let's look at the critiques by the guys who actually fought the battle.  Quoting from the History Channel's 'History vs. Hollywood':  Maj. Bruce \"Snakeshit\" Crandall says \"'We Were Soldiers' is the best movie I've seen of this era\", Capt. Tony Nadal, \"essentially, everything depicted in the movie happened in some form\", Pvt. Bill Beck says \"Sam Elliot had Master Sgt. Plumley down to a tee\", Col. Hal Moore says \"The movie...fully captures the emotion, the tone, the content, and the intensity of that battle.\"  The vote of the panel of guys who actually fought the battle was 80% History,20% Hollywood.Who are we to say they're wrong? Some things may sound cliche' but that's what was said.Most of the lines in the movie are not made up, they are QUOTES! Read the book!  Discuss the movie with a Nam-Vet, and while you're at it, thank him.  Don't watch this movie for entertainment value. Watch it for a piece of understanding as to what our guys went through.As for our 'foreign delegation', if you don't like America, you darn sure won't like this movie.  Please DON'T see it.  You wouldn't have a clue."
	},
	{
		"number": 11,
		"text": "Behind even a forgotten war lies the memory of the fallen...This movie is definitely among the top 10 films ever made. It places the viewer right in the middle of the Vietnam War, grabs their emotions and sets them free. This movie commemorates the memories and makes heroes of each and every husband, brother, and son involved in a forgotten war- a war that was dismissed and frowned upon by the American nation as a whole. The film also takes the viewer into the home of the soldier. It invades the private life of the loved ones at home. We feel as though we are a part of the family in one scene, and the buddy of a fallen soldier in the next. A wife, child, friend of a soldier gone to war to fight for an ungrateful nation one minute, and the next the brave and loyal soldier. This moving and true story will take its viewer and bestow upon them a closer understanding, and a greater respect and gratefulness for our nation's true heroes."
	},
	{
		"number": 12,
		"text": "I for one am someone who was inspired to read the book \"We were Soldiers Once and Young\" after seeing this movie. WWS is about a distinct event that actually happened. SGM Plumley was a soldier's soldier, with five combat jumps in three wars and an astounding three combat infantry badges. LTC Moore was the sort of leader who could keep his head and lead his troops through the worst of battle. People who complain of clichés in this movie might as well complain that people in 18th century movies wear three-cornered hats.To those looking for an anti-war message, it is there. When Moore goes to Division headquarters and gets his mission, he asks about projected enemy in his area of operations. The staff officer standing next to the general says \"a manageable number.\" To this Moore responds with words to the effect of \"which means you have no idea.\" It turns out that Moore's battalion gets dropped on top of a vastly larger enemy force (if I remember correctly, they get dropped right next to an NVA brigade). Ordinarily, it order to assure success in attack, you want to have three times the numbers of your enemy. In this case, the ratio was 4:1 going the other way. Then the battle is about how artillery and air support makes up the difference in numbers.The obvious criticism here is that the command was fumbling around in the dark. At the end of the movie, the names of the 70+ men who died are prominently displayed on the screen. A military mind is not treasonous and will not disrespect its superiors, but it will let facts speak for themselves.The next comment is only tangentially related to this movie. However, many voices here have taken the opportunity to vent their views on Vietnam, so I feel compelled to put things in a broader historical context. There was a war that did not take place between 1945 and the fall of the Berlin wall. It would have been called WWIII. The Soviet Union and the US stood eye-to-eye for 40+ years, but did not blink. It was an ideological conflict with an evil that meant death to 50+ million people in communist countries in this century. It was conflict with a system that vastly constrained freedom. Fortunately for the world, the US finally prevailed. The struggle fought between communism and the west was fought in a variety of ways: in public relations, in sports, in propaganda, and in a series of proxy wars. In Korea, Greece, Vietnam, Afghanistan and a variety of smaller stages, East contested with West. To the people caught up in these local conflicts, these wars were absolute tragedies. However, in the grand scheme of things, these conflicts pale to insignificance when compared to the 500,000,000 who would have died in WWIII."
	},
	{
		"number": 13,
		"text": "I took four teenage boys to see this movie.  They said this is thefirst movie about Vietnam that portrayed our soldiers as good men similar in age, with the same hopes and fears, and not a bunch of drug addicted babykillers.  I wish they would show this movie to all brainwashed high school kids."
	},
	{
		"number": 14,
		"text": "The movie was very powerful.Ok, where do I start.I finally saw a movie to motivate me to write a movie review on IMDB. I took a loooong flight just to watch the movie and it did not disappoint! Mel is as impressive as always and the rest of the cast did a great job as well, particularly Sam Elliott. Well so many great things have been said about the movie, and I can't think of anything negative to mention so I can't relate to those who did (if you have seen the movie, you'll know that most of the negative reviews here are bullsh*t).Anyway, I want to point out the scene where Mel was leaving his home. That entire scene was eerily effective, I could really feel the impending danger he will face every hair on my body was rising! I liked the way the camera panned very quickly when he turned to face the road, as if Mel said \"this is really sad but I have work to do\". I think that entire scene was very very well set up. And when the action started, the tension never stopped! I now really have to read the book because I find the tactical warfare very interesting.Anyway, I saw something interesting while watching the movie. There's this teenager sitting beside me, and I was really sorry for him, because he probably didn't know what he came in for. When the war action started, his eyes were really popped out! I swear to god I could have picked them with ease! His arms were gripping the armrest so hard and half his body slightly leaning forward. He was difficult not to notice even by the side of your eyesight because he looked shocked as hell. When I tried to quickly look at him (just to see if he's still breathing), he got embarrassed and leaned back to his chair. Five mins. later he was back in the same position. He was probably around 16 or 17 yrs. old so I realize that age might not be the right age to see it.What really amazes me is how the movie was able to convey the chaos and horror of the war when it actually they didn't seem to use too many CGI-effects. I look so much like the REAL THING!Definitely now on top of my list of war movies.And I have seen A LOT."
	},
	{
		"number": 15,
		"text": "In the tradition of such war film classics as The Bridges at Toko Ri, To Hell and Back well as John Wayne's The Green Berets is this seemingly out of place epic with the amount of cynical pestilence abound.The pace is lightning fast once the scenes transfer into the early period of the Vietnam war before the public grew impatient. The score of the film is often overlooked but in this case it provides plenty of emotion especially as the 7th Regiment assembles for the trip to South Vietnam beneath the radio towers late at night.Of a forgotten battle with unknown heroes for both forces this is a great war movie that should be a lesson for future productions."
	},
	{
		"number": 16,
		"text": "It is hard to stand out and be a unique war film. They've been making war films pretty much since the invention of film it seems. So you would think by now that it's all been done before, and for the most part it has. Yet We Were Soldiers manages to separate itself from the pack and give us a unique take on one particular battle in one particular war. Depicted here is the first major battle involving American troops in the Vietnam War. The fact that this battle takes place in what is known as the Valley of Death tells you all you need to know about what awaits the men who head into combat.The central figure in the movie is Lt. Col Hal Moore, played by Mel Gibson. Moore, leading the 7th Cavalry, will train his men and lead them into whatever hell awaits them. The film begins back home as Moore assembles his new unit and begins to whip them into shape. Here we learn much about what makes Hal Moore tick and begin to see him for the true leader of men he is. These opening scenes are important as they show many of Moore's motivations and also the obstacles which are placed in his way. The time back home also allows us to see Moore the family man with his strong, stoic wife, played by Madeline Stowe, and their young children. We also meet other key characters. There is Moore's second-in-command, battle-tested Sgt. Maj. Plumley, played with wonderful gruffness and all the appropriate seriousness by Sam Elliott. There is helicopter pilot Bruce Crandall, played by Greg Kinnear, and young Lt. Jack Geoghegan, played, surprisingly well for someone who came to prominence in a silly farce like American Pie, by Chris Klein. But the key figure throughout is undeniably Moore and Gibson's strong, confident portrayal is a key to the movie's success.While important in establishing the key characters and the emotional ties that bind them to each other and those whom they are leaving behind, the opening scenes back home have a feeling of just biding time about them. The film really takes off when the 7th Cavalry is dropped into the Valley of Death and confronts the overwhelming enemy force which awaits them. The rest of the film deals with this one epic, unrelenting battle. It sounds clichéd but the battle scenes are so well choreographed and photographed that you do truly feel as if you are there. The intensity of the conflict jumps off the screen. The focus is on the valor and heroism of the American soldiers but unlike so many war films which present a nameless, faceless enemy we also get to see things from the Vietnamese perspective. We see the enemy leaders detailing their strategy and also are presented with reminders that the Americans are not the only ones with loving, concerned families back home. We see the toll on both sides, not just for the soldiers but perhaps most poignantly in scenes inter-cut from home where soldiers' wives wait to learn the fates of the men they love.We Were Soldiers is a brutally honest, unflinching look at the hell that is war. It is a story which begged to be told. Seeing as it is adapted from a book by two of the central figures in the conflict, Hal Moore and reporter Joe Galloway who found himself thrust into the middle of the conflict (and who is played wonderfully by Barry Pepper in the film) you can rest assured that unlike so many other war films this one would focus on \"getting it right.\" The film tells it as it truly was. It is at times invigorating and inspiring and at other times truly heartbreaking. All in all it is a fitting tribute to, as the film states at the beginning, the men on both sides who died in that place."
	},
	{
		"number": 17,
		"text": "There are many war movies, but finally there is a decent one about the Vietnam war in stead of World War II.We were soldiers is a movie about the first American attack on the Vietnamese. A col. rides into battle with his man and they have to encouter several attacks from the enemy. It also tells the story from the wife of the col., who receives the telegrams of the dead soldiers.There are moments of action which are needed in a war movie. The action-moments are good and the special effects look real. There are also moments of drama, so the movie does not have full action only, which is good to stay concentrated. But the drama does not hurt the movie, because there's not to many of it.Overall it's a movie which keeps your focus to the last minute. It's not the best war movie ever, but you should certainly see it. Not only because of the very good acting of Mel Gibson."
	},
	{
		"number": 18,
		"text": "This was an EXCELLENT Movie. As hard to watch at times as Saving Private Ryan. Harder for me remembering friends who went over.\nI've heard of this story but never read about it. It  so hard to comprehend what happened. Not just to the 7th as the first to Fight but for all 58000+ who died and those who were wounded and survived with so many kinds of scars.The brutality and reality of war had to be close to the real thing. Gut wrenching and shocking but they handled it well. It doesn't need to be more real. The messages were all clear.  Including how inept their command and intelligence structure were. NO ONE Was truly prepared except the Vets who went. And they went in anyway. Think about it.Mel should be nominated for Best Actor. The Movie should be for best picture. Best Director as well. There were way too many good supporting performances to pick just one.I vividly remember the Draft Lottery in High School.  I was lucky and drew a high number.  But I can't count how many times I've wondered what may have happened with a lower number. It angers me still to know how some in our country treated those young men and women returning alive. Shame is the only word kind word that comes to mind. A movie worth seeing if you have a strong stomach. Whatever events were altered for the Cinema can't overshadow the final result. A powerful movie you won't forget."
	},
	{
		"number": 19,
		"text": "\"We Were Soldiers\" hit close to home because my dad and his friend Donald were in this very same battle. In 1965, my dad had just graduated from high school in Wichita, Kansas. He volunteered to enlist in the Army because there was practically nothing waiting for him there...My dad was stationed with the 1st Cavalry. The \"Valley of Death\" was where he fought his first major battle and lived. I'll never forget the scenes in this movie because my dad didn't have to be alive and well today. After seeing this movie, there has not been one day where I wondered what would have happened to me if he didn't live to see it.I am eighteen now, and my dad suggested that I see this and gain an idea on how gruesome the battle was and how he managed to live through it. I cried at the end, the same thing I did when I cried at the end of \"Platoon\", because I think of so many of those who may have been friends with my dad...who never lived to see the next day after that battle ended. I think of those who came back scarred deeply, not only physically, but emotionally and spiritually.And I will continue to cry for them....cry as deeply as I can..."
	},
	{
		"number": 20,
		"text": "Over the years, the movie going public has been subjected to film after film after film about the Vietnam War. Unfortunately, most of them are largely philosophical and don't paint the American soldier in a very positive light. The film makers usually take a leftist position towards the government and try to use the conflict on the ground as some sort of metaphor for the existential purpose of life. Thus, we get subjected to films like Apocalypse Now, Platoon, and Casualties of War. Although those film makers are certainly free to show us these interpretations of Vietnam, it gets old seeing our military trashed and our brave soldiers painted as drugged up sadists who were fighting for an immoral cause.From the beginning, you could tell We Were Soldiers is something different. It clearly shows the American soldier as what he/she usually is: Professional, brave, intelligent, and resourceful. There are no higher moral questions draped over this film. We simply see war as what it truly is. It is a conflict built up in the minds of our governments and carried out on the battlefield by our soldiers. Nothing more. Nothing less. Ultimately it is just about the man next to you and the men you're fighting against. We Were Soldiers focuses on this and this alone. The Ia Drang battle scenes (which take up most of the screen time) are ferocious. Mel Gibson shines as Col. Moore. He is the ultimate personification of masculinity. He ignores repeated requests for him to leave the battlefield as his troops are cut off and outnumbered. He seems to take the loss of each man personally as each commander should do. The combat footage is very graphic. This is not a film for those with weak stomachs.\nThis film also gives us another thing other Vietnam War films are reluctant to even touch. It shows us behind the scenes footage of the North Vietnamese Army planning their assaults and evaluating American tactics. It's about time some movie showed the human side to the NVA. They are usually portrayed as heartless, soul-less savages. This is ridiculous. They were family men who took just as much pride in a job well done as our own troops.\nWe Were Soldiers is an experience you won't soon forget. It is the pinnacle of what a war film should be. Not much time wasted on politics or existential philosophy. It is simply a graphic a realistic portrayal of war. For the soldiers on the battlefield, it isn't a matter of politics or a question of should we be here or not. What it comes down to is this: you have to kill your enemy or he will kill you!4 1/2 of 5 starsSo sayeth the Hound."
	},
	{
		"number": 21,
		"text": "From the trailers, this looked like just another war movie starring Mel Gibson. At first glance, I thought it was just a generic war flick. How wrong I was. I'm glad I'm not one of those people who shuns movies just because of lack of interest. That is how I got to loving movies like the Matrix and Desperado. This movie caught my eye, because Mel Gibson is great in everything he's in, but again, this looked like another war movie that wasn't as deep as its older brothers. We Were Soldiers separates itself from Mel's other War flicks. While Braveheart and the Patriot focus on one soldier and his life (along with several battle scenes), We Were Soldiers focuses on the lives of many soldiers, their families, even one of the Viet Cong soldiers, as their lives are affected in a deadly battle.This film takes place in the Vietnam War, the only war we ever officially lost. The first half hour revolves around training the troops... basically, the exposition. Soon after, they fall into battle. This battle makes up most of the movie. This isn't necessarily bad. For people who like seeing blood and guts, you will love this movie. Those who want to see some story, you will also love this movie. In fact, the acting was done so well in We Were Soldiers, that I nearly burst into tears in the end in sympathy for a Viet Cong soldier. That's another reason why this movie is so great. While some movies portray the \"other side\" to be barbaric and want to spill our guts, We Were Soldiers actually gives the Viet Cong soldiers feelings. Even the leader, who was shouting out orders to kill us all... Our leader was doing the exact same thing. However, we only see the Viet Cong leader being barbaric because they are the \"antagonists\". That, I highly disagree with. If you should see this movie, keep in mind that the antagonists are NOT the Viet Cong, but the war itself. This movie, as generic and unoriginal as the trailers made it seem, was one-of-a-kind, and if you have not seen it yet, make it a point to. It pays tribute to all the fathers, brothers, husbands, and sons who died in 'Nam. Braveheart and the Patriot are better, but this one should not be looked down upon. On a scale 1/10 (10 best), I give We Were Soldiers about a 15. Soldier, DISMISSED!"
	},
	{
		"number": 22,
		"text": "If you did not serve in the military, don't bash this movie as did Boojob.357. Many of us that served in Viet Nam appreciate a movie like this.It shows how the enemy, too, bravely fought, and what war can do to both sides, especially the families. Those that dislike this movie, are those that would never serve to protect America, as did many of our politicians, whom back then were draft dodgers. Don't talk the talk, if you've never walked the walk. Besides, this movie gives us Hispanics [ like Puerto Ricans], credit for serving our country; not like \"Saving Private Ryan\", where Hollywood forgot that we Hispanics have proudly served, and many have been awarded the \"Congressional Medal of Honor\" I'm proud to say that I served with the 5/7 A Company, and 2/7 D Company, 1966-67, and a combat wounded veteran."
	},
	{
		"number": 23,
		"text": "I wasn't expecting much from this film because many of the reviews I'd read at the time of its release argued that it, and the book it was based on, were retrograde. The US soldiers provide the heroes and the North Vietnamese the villains. But it wasn't nearly so simple as that.Obviously it's been heavily influenced by \"Saving Private Ryan\", at least in one respect. It's even gorier than SPR. If a phosphorous grenade explodes, we see the Grunt with the flaming stuff stuck to his skin and clothing, burning holes into him, and we see a buddy cutting away the burning flesh of his cheek with a knife. When a Grunt is caught in a friendly-napalm blast he really burns and afterward his charred flesh is blackened, so that when a buddy tries to take his legs and pull him towards a Medivac the flesh of both legs from the knees down peels off into his buddy's hands. And of course there is squib charge upon squib charge exploding in slow motion, an unfortunate cliché by now.One wonders just in passing how far this trend towards realistic gore can go -- and what the purpose behind the trip is. Well, it can't go much farther than it has. It seems just a short time ago that \"M*A*S*H\" had one shocking scene in it -- a wounded soldier in a hospital whose arterial blood pumped out of his body towards the surgeon. Actually it was more than thirty years ago. But our cinematic carnage has progressed by leaps and bounds. \"M*A*S*H\" was an early milestone. So was \"Bonny and Clyde,\" which introduced slow-motion death to American movies. \"Saving Private Ryan\" was a shocking blood bath. Now we have \"Blackhawk Down\", with a still-living soldier whose lower half has been blown away. And now there's \"We Were Soldiers.\"As for WHY there has been such an increase of realism in violence, well, that's a different question whose answer can only be guessed at. Many cinematic movements like this one seem to follow a trajectory in which each film must out-do the previous examples of the genre. If gore is good box office, then more gore is even better box office. There may be a sincere desire on the part of the producers to show combat as it really is, but like all motives this one may be mixed, with some commercial interests thrown into the stew. And the motives of the audiences who turn these films into marketable products? It would be nice to think that they leave the theaters having learned something about the results of combat. But if that's the case, we don't seem to be showing much evidence of having grasped the lesson. In a sense, sensational gore cheapens and degrades the experience of the men and women who have lived through these extreme situations. So much suffering brings tears to the eyes, especially when we see the survivors visiting graves and monuments after the battle, as we do both here and in \"Saving Private Ryan.\" And then, having wept, the audience leaves the theater and embraces the next war. The arousal jag is over. Good intentions, when viewed from a slightly different angle, have an uncanny way of resembling exploitation.Okay. Enough philosophy. The movie is better than I'd expected it to be, the excess of gore and the slow-motion clichés aside. (I was also confused by the topography, although locations are clearly labelled. Where exactly is the creek bed?) There isn't much in the way of home-front scenes, but what there is neatly reflects the anxiety and pain of those left behind. The combat scenes are exhausting. A few hundred Americans opposed by some four thousand regulars of the North Vietnamese army. (About the same ratio of Americans to adversaries as General Custer faced, only he had no air support. Custer is brought up several times.) But, most important, this is the first film I can remember seeing about the Vietnam war in which the enemy is presented as something other than outright evil. There is a good deal of irony in the movie. Mel Gibson prays before the battle. Take us under your wing, and so forth, he asks. Then throws in, \"Ignore those pagans praying to a different God.\" Much later in the film, long enough for us to have forgotten Gibson's racist plea, the commander of the North Vietnamese army is also seen praying -- presumably to the same God. And one of the NV soldiers is humanized to the extent of keeping on his person a diary written to his wife. (The soldier wears glasses so we can tell him from the other North Vietnamese and remember him.) He dies heroically and when the Americans take the diary from his body and flip through it, they find a picture of his wife, a woman who bears an uncanny resemblance to Gibson's wife, played by Madeleine Stowe. We win the battle (Ia Drang) of course, but even this is undercut by irony. The NV commander looks at the piles of bodies after the Americans leave. He shakes his head and says, \"What a tragedy.\" The worst part of it, he muses, is that the Americans will treat this as a victory and the war will go on to its necessary end, although now it will mean just that many more deaths.Should you bother watching this? I think so. This one would have been a true original if it had appeared twenty years ago."
	},
	{
		"number": 24,
		"text": "I \"was\" in the '60's, and knew the Vietnam war well, as well as, friends that went, and some that didn't come back.  This movie portrays the war with ALL the affects on the soldiers and their families.  This is the first Vietnam movie that showed what went on at home while our men were at war."
	}
]